def find_min(arr):
    # Функция `find_min` принимает один аргумент `arr`, который представляет собой список чисел.
    return min(arr)  # Возвращает наименьший элемент в массиве.

# Пример использования
my_array = [5, 2, 8, 1, 9, 3]
result = find_min(my_array)
# Переменная `my_array` содержит список [5, 2, 8, 1, 9, 3].
# Функция `find_min` вызывается с этим списком и результат присваивается переменной `result`.
print("Наименьший элемент:", result)
# Выводится сообщение "Наименьший элемент:" с значением, полученным из функции `find_min`.
